Masmiseim36/nxpSDK/devices/MIMXRT735S/drivers/fsl_power.c
    PMC->PDSLEEPCFG1 = (PCFG1_DEEP_SLEEP & ~exclude_from_pd[2]) | (PMC->PDRUNCFG1 & ~exclude_from_pd[2]);

    /* When either PLL, FRO, TEMPERATURE, POR, LVD, HVD enabled, the PMCREF_LP should be cleared. */
    if (((exclude_from_pd[0] &
          (SLEEPCON0_SLEEPCFG_FRO0_PD_MASK | SLEEPCON0_SLEEPCFG_FRO1_PD_MASK | SLEEPCON0_SLEEPCFG_FRO2_PD_MASK |
           SLEEPCON0_SLEEPCFG_AUDPLLANA_PD_MASK | SLEEPCON0_SLEEPCFG_AUDPLLLDO_PD_MASK |
           SLEEPCON0_SLEEPCFG_PLLANA_PD_MASK | SLEEPCON0_SLEEPCFG_PLLLDO_PD_MASK)) != 0U) ||
        ((exclude_from_pd[2] &
          (PMC_PDSLEEPCFG1_HVDN_PD_MASK | PMC_PDSLEEPCFG1_LVDN_LP_MASK | PMC_PDSLEEPCFG1_PORN_LP_MASK |
           PMC_PDSLEEPCFG1_HVD2_PD_MASK | PMC_PDSLEEPCFG1_LVD2_LP_MASK | PMC_PDSLEEPCFG1_POR2_LP_MASK |
           PMC_PDSLEEPCFG1_HVD1_PD_MASK | PMC_PDSLEEPCFG1_LVD1_LP_MASK | PMC_PDSLEEPCFG1_POR1_LP_MASK)) != 0U))
    {
        PMC->PDSLEEPCFG1 &= ~PMC_PDSLEEPCFG1_PMCREF_LP_MASK;
    }

    PMC->PDSLEEPCFG2 = (PCFG2_DEEP_SLEEP & ~exclude_from_pd[3]) | (PMC->PDRUNCFG2 & ~exclude_from_pd[3]);
    PMC->PDSLEEPCFG3 = (PCFG3_DEEP_SLEEP & ~exclude_from_pd[4]) | (PMC->PDRUNCFG3 & ~exclude_from_pd[4]);
    PMC->PDSLEEPCFG4 = (PCFG4_DEEP_SLEEP & ~exclude_from_pd[5]) | (PMC->PDRUNCFG4 & ~exclude_from_pd[5]);
    PMC->PDSLEEPCFG5 = (PCFG5_DEEP_SLEEP & ~exclude_from_pd[6]) | (PMC->PDRUNCFG5 & ~exclude_from_pd[6]);

    /* Stall Hifi4 if power down VDD2_DSP*/
    if ((PMC->PDSLEEPCFG0 & PMC_PDSLEEPCFG0_V2DSP_PD_MASK) != 0U)
    {
        SYSCON0->DSPSTALL = SYSCON0_DSPSTALL_DSPSTALL_MASK;
    }

    /* Set PMC_CTRL[APPLYCFG]. */
    while ((PMC->STATUS & PMC_STATUS_BUSY_MASK) != 0U) /* Cannot set APPLYCFG when ACTIVEFSM is 1 */
    {
    }
    PMC->CTRL |= PMC_CTRL_APPLYCFG_MASK;
    while ((PMC->STATUS & PMC_STATUS_BUSY_MASK) != 0U) /* Wait all PMC finite state machines finished. */
    {
    }

    /* Clear all event flags before enter deep sleep */
    PMC->FLAGS    = PMC->FLAGS;
    PMC->PWRFLAGS = PMC->PWRFLAGS;

    /* Disable LVD core reset. */
    pmc_ctrl  = PMC->CTRL;
    PMC->CTRL = pmc_ctrl & ~(PMC_CTRL_LVDNRE_MASK | PMC_CTRL_LVD2RE_MASK | PMC_CTRL_LVD1RE_MASK |
                             PMC_CTRL_AGDET2RE_MASK | PMC_CTRL_AGDET1RE_MASK);

    /* Deinit XSPI interface in case XIP */
    deinitXip();

    if (backupCache[1]) /* Xcache is not retented in DSR mode. */
    {
        cacheEnabled[1] = ((XCACHE1->CCR & XCACHE_CCR_ENCACHE_MASK) == 0U) ? false : true;

        if (cacheEnabled[1])
        {
            POWER_DisableCache(XCACHE1);
        }
    }
    if (backupCache[0]) /* Xcache is not retented in DSR mode. */
    {
        cacheEnabled[0] = ((XCACHE0->CCR & XCACHE_CCR_ENCACHE_MASK) == 0U) ? false : true;

        if (cacheEnabled[0])
        {
            POWER_DisableCache(XCACHE0);
        }
    }

    if (mode == kPower_DeepSleep)
    {
        /* The DMA HWWake function requires all the ACK of modules supporting HWWake, do handshake for those modules. */
        POWER_DMA_HWWake_LPRequest();
    }

    /* If the first one to Deep Sleep, ignore the Ignores power-down ready signal from LPOSC, FRO2. */
    if ((PMC->STATUS & PMC_STATUS_DSSENS_MASK) == 0U)
    {
        SLEEPCON->PWRDOWN_WAIT |= SLEEPCON0_PWRDOWN_WAIT_IGN_FRO2PDR_MASK | SLEEPCON0_PWRDOWN_WAIT_IGN_LPOSCPDR_MASK;
    }

    /* Enter deep sleep mode */
    __WFI();

    if (mode == kPower_DeepSleep)
    {
        POWER_DMA_HWWake_LPRestore();
    }

    if (backupCache[1])
    {
        if (cacheEnabled[1])
        {
            POWER_EnableCache(XCACHE1);
        }
    }
    if (backupCache[0])
    {
        if (cacheEnabled[0])
        {
            POWER_EnableCache(XCACHE0);
        }
    }

    /* Init XSPI in case XIP */
    initXip();

    /* Restore PMC LVD core reset and OTP switch setting */
    PMC->CTRL = pmc_ctrl;

    SCB->SCR &= ~SCB_SCR_SLEEPDEEP_Msk;
    __set_PRIMASK(pmsk);
}

AT_QUICKACCESS_SECTION_CODE(void POWER_EnterDSR(const uint32_t exclude_from_pd[7]))
{
    POWER_EnterLowPower_FullConfig(exclude_from_pd, kPower_DeepSleepRetention, POWER_DEFAULT_PMICMODE_DSR);
}
#else
/* Need do low power request-ack for all the modules capable of DMA HW Wake function if the DMA_HWWake is used. */
AT_QUICKACCESS_SECTION_CODE(static void POWER_DMA_HWWake_LPRequest(void))
{
    uint32_t lpReqClockCfg, lpReqResetCfg;

    if (SLEEPCON1->HW_WAKE != 0U) /* Only assert the LP Requet when DMA HW_WAKE enabled. */
    {
        lpReqClockCfg  = CLKCTL1->PSCCTL1;
        lpReqResetCfg  = RSTCTL1->PRSTCTL0;
        lpReqConfig[0] = SLEEPCON1->PRIVATE_CCTRL0;
        lpReqConfig[1] = SLEEPCON1->SHA_MED_TCTRL0;
        lpReqConfig[2] = SLEEPCON1->SHA_SEN_TCTRL0;
        lpReqConfig[3] = SLEEPCON1->PRIVATE_TCTRL0;

        CLKCTL1->PSCCTL1_SET =
            CLKCTL1_PSCCTL1_EDMA2_MASK |
            CLKCTL1_PSCCTL1_EDMA3_MASK; /* DMA clock need to be enabled to finishe low power handshake. */
        RSTCTL1->PRSTCTL0_CLR =
            RSTCTL1_PRSTCTL0_EDMA2_MASK |
            RSTCTL1_PRSTCTL0_EDMA3_MASK; /* DMA reset need to be cleared to finishe low power handshake. */

        SLEEPCON1->PRIVATE_CCTRL0 |= PRIVATE_CONTROLLER_HWWAKE_MODULE_MASK;
        SLEEPCON1->SHA_MED_TCTRL0 |= SLEEPCON1_SHA_MED_TCTRL0_FLEXIO_B_LPREQ_MASK; /* FLEXIO Bus*/
        SLEEPCON1->SHA_SEN_TCTRL0 |= SLEEPCON1_SHA_SEN_TCTRL0_MICFIL_STOP_MASK;    /* MICFIL */
        SLEEPCON1->PRIVATE_TCTRL0 |= PRIVATE_TCTRL_HWWAKE_MODULE_MASK0;            /* SAI and LP_FLEXCOMM */

        while ((SLEEPCON1->PRIVATE_CSTAT0 & PRIVATE_CONTROLLER_HWWAKE_MODULE_MASK) !=
               PRIVATE_CONTROLLER_HWWAKE_MODULE_MASK)
        {
        }
        while ((SLEEPCON1->SHA_MEDSEN_TSTAT0 & SHA_MEDSEN_TSTAT_HWWAKE_MODULE_MASK) !=
               SHA_MEDSEN_TSTAT_HWWAKE_MODULE_MASK)
        {
        }
        while ((SLEEPCON1->PRIVATE_TSTAT0 & PRIVATE_TSTAT_HWWAKE_MODULE_MASK0) != PRIVATE_TSTAT_HWWAKE_MODULE_MASK0)
        {
        }
        CLKCTL1->PSCCTL1  = lpReqClockCfg;
        RSTCTL1->PRSTCTL0 = lpReqResetCfg;
    }
}

AT_QUICKACCESS_SECTION_CODE(static void POWER_DMA_HWWake_LPRestore(void))
{
    if (SLEEPCON1->HW_WAKE != 0U) /* DMA HW_WAKE enabled. */
    {
        /* restore the configuration */
        SLEEPCON1->PRIVATE_CCTRL0 = lpReqConfig[0];
        SLEEPCON1->SHA_MED_TCTRL0 = lpReqConfig[1];
        SLEEPCON1->SHA_SEN_TCTRL0 = lpReqConfig[2];
        SLEEPCON1->PRIVATE_TCTRL0 = lpReqConfig[3];
    }
}

/** @brief This API configure the SLEEPCON SLEEPCFG and PMC_PDSLEEPCFG registers.
 *
 * @param exclude_from_pd the bits mask need to be cleared for the registers.
 */
AT_QUICKACCESS_SECTION_CODE(void static POWER_EnterLowPower_FullConfig(const uint32_t exclude_from_pd[7],
                                                                       power_mode_cfg_t mode,
                                                                       uint32_t pmic_mode_pins))
{
    uint32_t pmicMode;
    uint32_t pdsleepcfg0;
    uint32_t pmc_ctrl;

    uint32_t pmsk = __get_PRIMASK();

    __disable_irq();

    SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;

    /* Power on mask bit correspond modules during Deep Sleep mode. */
    SLEEPCON->SLEEPCFG = (SCFG0_DEEP_SLEEP & ~exclude_from_pd[0]) | (SLEEPCON->RUNCFG & ~exclude_from_pd[0]);

